/*
4. В строке текстового файла задано выражение из целых
чисел и операций '+', '-', '*', '/', '^'. Порядок вычислений
определяется приоритетом операций и круглыми скобками. Возможен
одноместный минус в начале выражения или после открывающей
скобки. Преобразовать выражение в постфиксную форму (алгоритм
Дейкстры) и вычислить его значение. Показать этапы выполнения
(11)
Арутюнян Давид, ПС-23
gcc 7.2.0, CLion
*/

#ifdef _WIN32

#include <windows.h>

#endif

int main(int argc, char* argv[])
{
#ifdef _WIN32
    SetConsoleOutputCP(CP_UTF8);
#endif
}
